{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "/opt/data/private/gaoj/GaoJing/curriculum/Fundamentals_and_Applications_of_Large_Models/Model_Finetune/dataset/cache/Qwen/Qwen3-VL-2B-Instruct",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [],
  "peft_type": "LORA",
  "peft_version": "0.18.0",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": "^(model.language_model.*\\.(gate_proj|o_proj|v_proj|q_proj|k_proj|down_proj|up_proj)|(?!(model.visual.merger|model.visual.deepstack_merger_list))model.visual.*\\.(qkv|attn.proj|linear_fc1|linear_fc2)|model.visual.merger.*\\.(linear_fc1|linear_fc2)|model.visual.deepstack_merger_list.*\\.(linear_fc1|linear_fc2))$",
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}